app/controllers/drinks_controller.rb

  def index
    @drinks = Drink.all
---
SELECT "drinks".* FROM "drinks"

  def create
    @drink = Drink.new(drink_params)

    respond_to do |format|
      if @drink.save
---
INSERT INTO "drinks" ("name", "temperature", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Cappucino"], ["temperature", 135], ["created_at", "2017-11-11 01:29:07.983772"], ["updated_at", "2017-11-11 01:29:07.983772"]]

    def set_drink
      @drink = Drink.find(params[:id])
---
SELECT  "drinks".* FROM "drinks" WHERE "drinks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]